FROM python:3.11-slim

#внутри контейнера работаем из /app - как 'cd /app' в терминале
WORKDIR /app

#Сначала ставим зависимости - отдельным слоем, чтоюы докер кешировал
#этот шаг и не переустанавливал библиотеки при кажлом изменении кода
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

#копируем папку app/ внутрь контейнера в /app/app
COPY app ./app

#Не буферизовать stdout - иначе логи могут "застрять" и не попасть в docker logs
ENV PYTHONBUFFERED=1
#Документируем, что контейнер слушает порт 8000 (метаданные для других инструментов)
EXPOSE 8000

#Команда запуска контейнера. Формат списка (не строка) - чтоюы CTRL+C
#корректно передавался процессу. --host 0.0.0.0 обязательно: иначе
#снаружи контейнера сервис будет недоступен
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0", "--port", "8000"]